source/tips/index.org
#+BEGIN_HTML
---
layout: page
title: "tips"
date: 2013-05-08 00:49
comments: true
sharing: true
footer: true
---
#+END_HTML

* Rails Software Development
+ [[file:rubymine/index.html][RubyMine Tips]]
+ [[file:rails/capybara-phantomjs-poltergeist-rspec-rails-tips.html][Integration (aka feature spec) testing using Capybara, PhantomJs, Poltergeist,
  and Rspec Tips]].
+ [[http:../blog/2014/03/11/rocking-with-tmux-tmuxinator-and-iterm2-for-rails-development/index.html][tmux, tmuxinator, Guard, Zeus, and iTerm2 for Rails Development]]  
* Octopress
+ [[http://www.railsonmaui.com/blog/2014/03/05/octopress-setup-with-github-and-org-mode-v2/][Org-Mode Octopress Setup V2]]
+ [[file:renaming-redating-blog-posts.html][Renaming, Redating Blog Posts]]
+ [[http://www.brokenlinkcheck.com/broken-links.php][Check your blog for broken links]]: Super useful to scan for broken links. This
  link is more efficient than the [[http://validator.w3.org/checklink][W3C Link Checker]].

* General Mac Tips
+ [[file:alfred-tips.html][Alfred (Productivity App)]]
* Pair Programming
+ [[http://www.railsonmaui.com/blog/2014/05/06/remote-pair-programming-tips-using-screenhero/][Remote Pair Programming Tips using RubyMine and Screenhero]]
