source/tips/index.html
---
layout: page
title: "tips"
date: 2013-05-08 00:49
comments: true
sharing: true
footer: true
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Rails Software Development</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="rubymine/index.html">RubyMine Tips</a>
</li>
<li><a href="rails/capybara-phantomjs-poltergeist-rspec-rails-tips.html">Integration (aka feature spec) testing using Capybara, PhantomJs, Poltergeist,
and Rspec Tips</a>.
</li>
<li><a href="http:../blog/2014/03/11/rocking-with-tmux-tmuxinator-and-iterm2-for-rails-development/index.html">tmux, tmuxinator, Guard, Zeus, and iTerm2 for Rails Development</a>  
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Octopress</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="http://www.railsonmaui.com/blog/2014/03/05/octopress-setup-with-github-and-org-mode-v2/">Org-Mode Octopress Setup V2</a>
</li>
<li><a href="renaming-redating-blog-posts.html">Renaming, Redating Blog Posts</a>
</li>
<li><a href="http://www.brokenlinkcheck.com/broken-links.php">Check your blog for broken links</a>: Super useful to scan for broken links. This
link is more efficient than the <a href="http://validator.w3.org/checklink">W3C Link Checker</a>.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">General Mac Tips</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="alfred-tips.html">Alfred (Productivity App)</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Pair Programming</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://www.railsonmaui.com/blog/2014/05/06/remote-pair-programming-tips-using-screenhero/">Remote Pair Programming Tips using RubyMine and Screenhero</a>
</li>
</ul>
</div>
</div>
